//-----------------------------------------------------------------------------
//--- Терминальная программа тестирования и отработки методов работы со 
//--- структурами и привязанными к ней методами управления 
//--- Библиотека lib.rs содержит описание структуры и ее методов
//---
//--- Разработан вариант программы Life со стандартными правилами Конвея
//--- Предполагается развитие программы с возможностью задания новых правил,
//--- размещением первичных популляций, возможно с полями переменных правил..
//-----------------------------------------------------------------------------
//--- Author: Kornilov LN (Starmark)
//--- e-mail: KornilovStar@gmail.com
//--- e-mail: ln.starmark@ekatra.io
//--- e-mail: ln.starmark@gmail.com
//--- date:   13.08.2023 22:09:00
//-----------------------------------------------------------------------------

use std::{env};

//--- библиотека lib.rs содержит: ---------------------------------------------
//--- [generation() posev() census() displayworld() run() populate_from_file()]
use life::*;
//-----------------------------------------------------------------------------

fn main() {
	let args: Vec<String> = env::args().collect();

	//--- Структура (методы описаны в lib.rs)
	let field = Field {
		width : COLUMNS,
		height : RAWS,
		tor : false,
		algo : 0,
	};

	//--- массив под внешнее поле жизни
	let mut world = [[0u8; COLUMNS]; RAWS];

	if args.len() < 2 {	
		//--- заполнение поля случайными клетками
		Field::posev(&field, &mut world);
	}else{				
		//--- взять засев из файла
		let filename = env::args().nth(1).unwrap();
		world = Field::populate_from_file(filename);
	}

	//--- поле жизни
    field.run(world);	
}

